[Logons - 4624]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = `windows_event_logs` EventCode=4624 TargetUserName!="*$" TargetUserName!="SYSTEM"\
| lookup win_logon_type LogonType AS LogonType OUTPUT LogonTitle\
| table Computer, EventCode, name, TargetUserName, LogonType, LogonTitle

[Logons - NTLM & Kerberos]
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","TargetUserName","IpAddress"]
display.events.type = table
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = `windows_event_logs` EventCode IN (4776, 4768, 4769)\
| table _time, Computer, EventCode, name, TargetUserName, IpAddress

[Password Policies]
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","TargetUserName","IpAddress"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = index=admetrics sourcetype="ActiveDirectory:Users"\
| dedup PasswordPolicy_Name\
| table PasswordPolicy*

[New Users]
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","TargetUserName","IpAddress"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = index=admetrics sourcetype="ActiveDirectory:Users" \
| dedup SID sortby -_time\
| table SamAccountName, createTimeStamp

[Tier 0 Groups]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = * * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","TargetUserName","IpAddress"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = index=admetrics source="powershell://Groups"  IsTier0=True\
| dedup SID sortby -_time\
| eval tier=if(IsTier0=="True", 0, null())\
| table SamAccountName, DistinguishedName, SID, tier, IsTier0\
| outputlookup group_tier

[Kerberoasting - SPNs]
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","TargetUserName","IpAddress"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = index=admetrics source="powershell://Users" ServicePrincipalNames!=""\
| dedup SID sortby -_time\
| table SamAccountName, ServicePrincipalNames, SupportedEncryptionTypes

[Tier 0 Users]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","TargetUserName","IpAddress"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = index=admetrics source="powershell://Users" memberOfCSV!=""\
| dedup SID sortby -_time\
| eval memberOf=split(memberOfCSV, ";")\
| mvexpand memberOf\
| lookup group_tier DistinguishedName AS memberOf OUTPUT tier AS tier\
| search tier=0\
| stats dc(memberOf) AS Tier0GroupCount, values(memberOf) AS Tier0GroupMemberships BY SID, CN

[T1552.006 - Unsecured Credentials: GPP]
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["source","sourcetype","TargetUserName","IpAddress"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = ADMetrics_for_Splunk
request.ui_dispatch_view = search
search = index=admetrics sourcetype="ActiveDirectory:T1552-Unsecured_Credentials"\
| dedup File, Changed, UserName sortby -_time\
| table UserName, Changed, File
